app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating in ('G')) ORDER BY release_date
---
  def index
   ensure_table_filters
   filters = session[:table_filters]
   @order = filters[:order]
   @ratings = (filters[:ratings]) ? filters[:ratings].values : []

   if Movie.column_names.include? @order